Tekla Open API Reference for Tekla Structures 2025
InvalidTypeException Class
 The InvalidTypeException class defines the exception that is thrown when a type was not one of the allowed ones.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.InvalidTypeException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InvalidTypeException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class InvalidTypeException
	Inherits TeklaStructuresDrawingsApplicationException
The InvalidTypeException type exposes the following members.
Constructors
Name | Description
InvalidTypeException
 Creates a new InvalidTypeException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace